---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpEnable
source: html/91117578-223f-0a52-324f-46d2abee1052.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpEnable Property

The property labeled "Type" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassBumpEnable { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassBumpEnableType".